[
    {
        "url": "http://timesofindia.indiatimes.com/india/Remove-all-religious-structures-encroaching-on-roads-Allahabad-HC/articleshow/52700752.cms",
        "text": "LUCKNOW: The Allahabad High Court has directed the Uttar Pradesh government to remove or shift religious structures \"in any form\" which encroach on public roads including sideways.It asked the state government to ensure that no religious structure in any form, whatsoever, shall be allowed or permitted to be raised on public roads including highways, streets, pathways and lanes and warned that any violation will be considered as criminal contempt by administration and police officials.A Lucknow bench of justices Sudhir Agarwal and Rakesh Srivastva said religious structures raised after January 2011 that encroach on public roads will be removed forthwith and a compliance report shall be submitted by concerned district magistrate to the state government within two months. Those raised earlier should be shifted to private land or removed within six months.It gave the directions on Friday while disposing of a writ petition filed by 19 locals against alleged encroachment of public pathway land in Mohalla Dauda Khera in Lucknow by construction of a temple.Observing that every citizen has a fundamental right of movement and this can not be allowed to be infringed by a few violators in public and apathy of state authorities, the high court also directed the state government to chalk out a plan so as to ensure that public roads were not obstructed due to observance of religious activities.It said such activities should not create hindrance in the smooth flow of traffic and movement of public on roads and should be performed strictly at the places identified for the same or belonging to concerned religious sections or at any private place.\"In our view, those who create such obstructions as also those who perpetuate it by taking care/managing such structures and also those who fail to take any action in law, all deserve to be taken to task and make responsible and accountable for their respective misdeeds,\" the court said.The court said it should be ensured that \"no religious structure in any form, whatsoever, shall be allowed/permitted to be raised on public road (including highways), street, pathway and lane, including sideways which is part and parcel of road and belong to the state\".It directed the state government through chief secretary to issue a general direction in this regard to all DMs and senior superintendent of police/superintendent of police including the officers responsible for maintenance of roads (including highways) in the state.",
        "score": -0.6431243678750111,
        "sentiment": "negative",
        "title": "Remove all religious structures encroaching on roads: Allahabad HC"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/PM-Modi-returns-home-after-5-nation-tour/articleshow/52685894.cms",
        "text": "NEW DELHI: Prime Minister Narendra Modi returned home on Friday after a five-nation tour whose highlight was his meeting with US President Barack Obama and address to US Congress in Washington.During his six-day tour, Modi also visited Afghanistan, Qatar, Switzerland and Mexico with an aim to bolster ties.He returned home early Friday morning from Mexico which was the last stop of his trip.Before leaving for home, Modi had tweeted, \"Thank you Mexico. A new era in India-Mexico ties has begun and this relationship is going to benefit our people and the entire world.\"\"Five days, five countries! After a productive visit to Mexico, the last leg of his journey, PM departs for Delhi,\" External Affairs Ministry spokesman Vikas Swarup had tweeted.Besides addressing a joint sitting of the US Congress, Modi received the backing of two key Nuclear Suppliers Group members - Switzerland and Mexico - for its bid to secure the membership of the 48-nation bloc.He also held wide-ranging talks with President Obama at the White House following which the US recognised India as a \"major defence partner\".",
        "score": 0.7132002826927929,
        "sentiment": "positive",
        "title": "PM Modi returns home after 5-nation tour"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Maneka-Gandhis-outburst-against-culling-of-nilgais-may-be-used-by-JDU-RJD-against-BJP/articleshow/52685493.cms",
        "text": "PATNA: Maneka Gandhi 's outburst against the culling of nilgai in Bihar's Mokama district is likely to be used by the state's Grand Alliance government against the BJP as farmers have been suffering from the menace caused by the animal.Nilgai has been troubling farmers because of the constant damage they do to standing crops in Bihar's major farming areas since long. In the early 1990s, the then BJP MLA from Buxar's Brahampur seat, SN Tewari, had continuously raised the issue of the fast-growing population of Nilgai in the assembly. However, then CM Lalu Prasad had asked the forest department to use drum beats to scare away the animal.The operation to cull the nilgai was undertaken at the initiative of JD(U) MLA Neeraj Kumar who approached professional shooters. Reports say that around 200 Nilgais have been killed recently. \"Maneka's opposition to killing of nilgai clearly shows that she is unaware of the problems our poor farmers face in Mokama area. The Centre issued a gazette notification putting nilgai under Schedule 5 on December 1, 2015.This led to permission for killing nilgai. Why was she silent all these months,\" asked MLC Neeraj. Neeraj supports the stand taken by environment and forest minister Prakash Javadekar",
        "score": -0.4255349261152024,
        "sentiment": "negative",
        "title": "JD(U), RJD may use Maneka's nilgai outburst against BJP"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/PM-Narendra-Modi-used-15-fewer-words-than-former-PM-Manmohan-Singh-in-US-Congress-speech/articleshow/52685166.cms",
        "text": "NEW DELHI: Perception on the use of their vocal chords apart, Prime Minister Narendra Modi used 15% fewer words than his predecessor Manmohan Singh in his speech to the joint sitting of the US Congress . And the one striking strand in their speeches was that neither deemed it appropriate to mention his predecessor despite obvious references to his contribution to Indo-US relations.Both mentioned the addresses by past PMs of their own parties while choosing different icons (Nehru and Ambedkar) to underline the influence of US Constitution and values in the framing of the Indian Constitution.Modi did not mention Manmohan Singh in his Wednesday's address despite two references about Indo-US civil nuclear deal. Likewise, Manmohan Singh in his address to the joint sitting of the American Congress, on July 19, 2005, did not mention Atal Bihar Vajpayee despite quoting him on India and America being \"natural allies.\"\"In the fall of 2008, when the Congress passed the India-US Civil Nuclear Cooperation Agreement, it changed the very colours of leaves of our relationship,\" Modi said before adding, \"civil nuclear cooperation, as I told President Obama yesterday, is a reality.\"Singh, however, did not find mention despite the fact that it was he who risked his government in Parliament against the combined wrath of Modi's BJP and the Left parties in July 2008, before the US Congress passed the India-US Civil Nuclear Cooperation Agreement in September 2008.But a scrutiny of Singh's 2005 speech leaves little reason for him to complain against Modi's omission of his name on Wednesday. Singh referred to Rajiv Gandhi 's speech from \"this very podium two decades ago (1985)\" but did not mention Atal Bihari Vajpayee 's speech made in 2000, which set the pace for the cordial relations between India and America.\"As two great democracies, we are natural partners in many ways,\" Singh said. Modi, in turn, credited Vajpayee for this coinage referring to him twice in his speech: \"Our independence was ignited by the same idealism that fuelled your struggle for freedom.No wonder then that former Prime Minister of India Atal Bihari Vajpayee called India and the US natural allies,\" Modi said. \"More than fifteen years ago, Prime Minister of India, Atal Bihari Vajpayee, stood here and gave a call to step out of the shadow of hesitation of the past.\"Modi and Singh chose different icons to underline the influence of American Constitution on the Indian Constitution. While Singh had used Jawaharlal Nehru to buttress his point, Modi cited Ambedkar to drive home the same point.As against 3,264 words of Singh's speech in 2005, Modi's speech comprised 2,754 words. Singh mentioned incumbent president George Bush many more times than Modi mentioned Obama. But, Modi mentioned 8 icons from the past as against 4 mentioned by Singh.",
        "score": 0,
        "sentiment": "neutral",
        "title": "Modi used 15% fewer words than Manmohan Singh in US speech"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Chhota-Shakeels-plot-to-kill-Rajan-foiled-4-arrested-Police/articleshow/52683736.cms",
        "text": "NEW DELHI: Four persons have been arrested for allegedly hatching a plan to kill gangster Chhota Rajan , presently lodged in Tihar jail , at the behest of his arch rival and fugitive don Dawood Ibrahim 's confidant Chhota Shakeel The four alleged contract killers, identified as Robinson, Junaid, Yunus and Manish, were arrested on June 3 following which they were sent to police remand and interrogated for five days.Later, they were produced in a court which sent them to judicial custody, a senior police official said on Friday.\"Investigation is underway,\" Special Commissioner of Police (Special Cell) Arvind Deep said.Delhi Police's Special Cell zeroed down on the four through telephone intercepts. The accused were in constant touch with Shakeel, police claimed.Once identified, the four were picked up from their residences in Rohini in Outer Delhi, Seelampur in northeast Delhi, Ghaziabad and Noida, the official said.Police also claimed have recovered a pistol and live cartridges from possession of one of the accused.They had allegedly planned to eliminate Rajan while the don is taken to court for hearing.The four accused are also lodged in Tihar jail, where Rajan is in a high-security ward, the official added.Rajan (55), who was on the run for around 27 years, was arrested from Bali in Indonesia , based on a tip-off from Australian Federal Police, and brought to India in November last year.",
        "score": -0.30263866521160876,
        "sentiment": "negative",
        "title": "Plot to kill Chhota Rajan foiled, 4 arrested"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/West-Bengal-CM-Mamata-Banerjee-readies-plan-to-enter-Left-bastion-of-Tripura/articleshow/52686061.cms",
        "text": "KOLKATA: With West Bengal firmly in her grip, Mamata Banerjee 's Trinamool Congress will now go the whole hog to try and wrest Tripura from the ruling Communist party. At present, it is taking every possible effort to displace the Opposition Congress as the main alternative. Apparently, Didi's party is now planning to go national, at least in her sole aim of making the Left irrelevant in national politics.Even though, Trinamool Congress succeeded in opening its account in north east states like Tripura and Manipur, her targets have been the states where communists still have considerable presence.With her attempts to foray into Tripura, one of the two red bastions in the country, TMC leaders are not ruling out possibility of making efforts to make an inroad into Kerala Speaking to ET, TMC's national vice president Mukul Roy said, \"We are determined to oust the CPM government from Tripura in 2018 assembly election. Our party supremo would be addressing a couple of public meetings in the state on June 14th and 15th.\" Meanwhile, Mamata's pointsman, Roy has managed to have six defections from the Congress, the principal Opposition in Tripura, to the Trinamool Congress.Explaining Trinamool's political expansion to the North-East, Roy said, \"In Tripura, soil is ready. There is enough anti-incumbency and people do not now see Congress as an alternative. So, people are now looking up to Mamata Banerjee and Trimaool would soon grow there. 2018 assembly election is crucial for us. And we are sure to gain grounds in Tripura. Our leader promised to people that she would make CPM irrelevant in national politics and it will happen soon.\"Tripura has 60 seats of which 50 are with CPM's Manik Sarkar , the chief minister of the state while Congress won in 10 seats. Sarkar is now continuing with his fifth consecutive term. A couple of days back, six of the 10 Congress MLAs defected to Trinamool Congress.Significantly, Trinamool Congress performed well in the Manipur Assembly Election in 2012, grabbing 7 seats. Speaking about party's position in Manipur, Roy said that TMC did well in Manipur in last election and it would make things better in the north-eastern state.The green party from Bengal tried to make inroad in Kerala too. Banerjee before election said that she would travel to the southern state and expose the CPM-Congress who had an alliance in Bengal and were fighting each other in Kerala. However, Mamata's plans for Kerala did not take off this time. \"We will enter Kerala soon. But now we are focusing on Tripura now,\" added Rory.",
        "score": 0.3775917209158986,
        "sentiment": "positive",
        "title": "Mamata readies plan to enter Left bastion of Tripura"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Congress-preparing-demographic-profiles-of-each-of-the-403-Assembly-constituencies-in-UP/articleshow/52685606.cms",
        "text": "NEW DELHI: Manifestos tailor-made for specific constituencies would be Congress ' trump card in the Uttar Pradesh Assembly elections next year. For this purpose, the Grand old Party is preparing demographic profiles of each of the 403 Assembly constituencies.The exercise includes identifying local electoral issues, tracing political history and specific caste dynamics of all the constituencies. \"We are in the process of framing these manifestos. We would also have a ready document on talking points and campaign strategy for the candidates looking at the Assembly constituency,\" a senior Congress leader told ET.This is the first time that Congress would have Assembly specific manifestos. Once the tickets are finalized by the party, the candidate will have leeway to make changes. \"The document will be a product of a meticulous study but the candidate would be able to make changes and then release it,\" said the leader.Besides this, a cadre building exercise has also begun down to the village level. The Congress has already identified 1 lakh foot soldiers across UP villages to take the campaign to every booth.The party is preparing this list with photo identities and phone numbers of these vetted workers. Block presidents have been asked to identify at least 10 dedicated Congress workers in each village.As a counter to the BJP 's massive Dalit reachout, the party has started an effort to identify five Dalit leaders per constituency. These leaders would in turn identify Dalit homes to help the chosen candidates to reaching across to them.",
        "score": 0.48554476895987475,
        "sentiment": "positive",
        "title": "Congress preparing seat-based manifesto for UP"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Amit-Shah-hails-PMs-diplomatic-feats/articleshow/52681012.cms",
        "text": "NEW DELHI: BJP on Thursday seemed to be in celebratory mood over over PM Narendra Modi's successful five-nation visit with party chief Amit Shah on Thursday claiming that the world has acknowledged India as a prosperous and strong nation and that NDA has achieved in the past two years what the country could not in several decades.\"PM Modi's recent trip has come across unprecedented success and it will be seen as a glorious phase of the country,\" said Shah in a statement. He said that India's inclusion in the Missile Technology Control Regime (MTCR) will make it a prominent missile manufacturing nation, adding that that the support of America, Switzerland and Mexico for India's bid for NSG reflects Modi's great diplomatic skills.\"It is due to the PM's diplomatic skills that countries like the US, Mexico and Switzerland are supporting India's bid to enter the NSG,\" Shah said. The US support to India underlines a new chapter in the friendship between the two countries, he said.In party circles, Modi's successful refutation is seen as a solid rebuff to sceptics and opponents - particularly Congress - who had expressed misgivings that Modi, with no experience of diplomacy, may find himself uncomfortable dealing with foreign leaders.Shah referred to the highest civilian honour bestowed on Modi by Afghanistan and said it showed the strong ties between the two countries. The zest and enthusiasm for Modi exhibited by members of the US Congress is \"unimaginable\", he said.Modi's call to isolate the countries sponsoring terror is also receiving support across the world, Shah said.The investment commitment made by US companies will help generate jobs and boost projects like 'Make in India' once these promises are realised, he said. Hailing Modi's leadership, he said the \"despondency\" prevalent two years ago, a reference to the UPA government, has been replaced by \"enthusiasm\". \"Even in troubled times India has left imprint of its strong leadership and carved an amazing place for itself in the world,\" he said.\"PM's meeting with CEOs of 20 prominent countries will result in huge investments in the country opening vistas of employment and development in the country,\" said Shah.",
        "score": 0.6037584215007439,
        "sentiment": "positive",
        "title": "Amit Shah hails PM's diplomatic feats"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Government-busy-with-songs-dance-when-country-facing-drought-says-Rahul-Gandhi/articleshow/52483585.cms",
        "text": "There is a drought all over the country.Farmers are committing suicide, but here at India Gate Modiji is celebrating with Bollywood stars\n\n\n\n— Office of RG (@OfficeOfRG) May 28, 2016\n\nNEW DELHI: Rahul Gandhi launched a stinging attack on the NDA government on Saturday over the mega event marking its two years in office, saying farmers are committing suicide for want of water in Maharashtra, but the Modi dispensation is busy celebrating \"with songs and dance with Bollywood stars\".Addressing party workers during Congress's 'mashal julus' (torch rally) to protest alleged power and water shortage in Delhi, Gandhi also targeted Chief Minister Arvind Kejriwal saying the latter speaks only on issues like odd-even and pollution, \"but doesn't work\". He also suggested the AAP leader is insensitive to \"pain of poor\".\"Two years have passed... there is drought across the country. In Vidarbha and Marathwada in Maharashtra, farmers are committing suicide, killing themselves.\"And here, at India Gate, two years are being celebrated, function has been organised, people from Bollywood have come, songs and dance have been arranged for,\" Gandhi told the gathering amid sloganeering against both Modi and Kejriwal.Seeking to differentiate himself from Modi and Kejriwal, Gandhi said he believes in \"politics of truth\" in line with Mahatma Gandhi's ideology and not in \"making false promises\".Hitting out at two leaders, he also claimed the duo think they can fool all people all the time in India.\"... Even if people of India tell me speak lies in politics, I can't do it. It's not in me. I may have suffered for speaking what I feel, I don't make false promises. But I can see, slowly, people of India and Delhi are realising that this country cannot move forward on false promises, not by hollowness, but blood and sweat,\" he added.He also exuded confidence that the Congress party, which he described as an organisation of \"blood and sweat and not public relations\", will return to power in forthcoming local body polls and also during next assembly elections.",
        "score": -0.4514667961622081,
        "sentiment": "negative",
        "title": "Govt busy celebrating during drought: Rahul Gandhi"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/AIMPLB-against-ban-on-triple-talaq/articleshow/52580657.cms",
        "text": "NEW DELHI: The All India Muslim Personal Law Board (AIMPLB) on Friday fielded its women members to reject the growing demand of women organisations for scrapping of the provision of 'triple talaq' and the organisation slammed the move as a conspiracy to impose a uniform civil code (UCC).AIMPLB women members hit out at the BJP-led NDA government saying the \"hype over demand for scrapping of the provision for \"triple talaq\" was a bid to facilitate a UCC and the Board will not tolerate any interference in Muslim personal law. Those Muslims who did not wish to follow the same were free to marry under the Special Marriages Act.AIMPLB executive member Dr Asma Zehra attacked those seeking scrapping of triple talaq saying, \"Some letter head organisations and women andolans have presented false concocted data in their survey re port, in which it is shown that 92% of Muslim women are in favour of ban on triple talaq and amendments in the Muslim personal law. It is also presented that 50,000 men and women have signed a petition to the National Commission for Women to abolish the Muslim code for divorce. We strongly condemn such a survey.\"The AIMPLB statement went on to add that \"these fringe groups and andolans have no credibility amongst Muslim masses\". Referring to Shayara Bano and Afreen Rehman who have filed petitions in the Supreme Court against the provision of triple talaq, the AIMPLB put forth the argument that the lower and higher judiciary is already burdened with large number of cases and average time of disposal is 4 to 8 years.\"These cases may take years. In contrast the Muslim personal law has simple and more successful way of solving family disputes,\" the Board members assert in their statement.Zehra went on to say that \"All those persons who want change are free to follow the civil code of the country. They can get married under the Special Marriages Act.\" She went on to say that \"the allegation of gen der bias is repeatedly raised to attack Islam and Muslims. It is portrayed that Islamic Law is anti women and cruel. This is not true. In fact, Islam guarantees equal rights to both men and women.\" She went on to explain that \"In Islam, talaq (divorce) is an unpleasant and discouraged act. If both the partners fail to reconcile, then divorce is a safe exit for unsuccessful marriages.The methodology and procedure of divorce is clearly explained in Quran and Hadith.\"",
        "score": 0,
        "sentiment": "neutral",
        "title": "AIMPLB against ban on triple talaq"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Congress-fields-Kapil-Sibal-for-Rajya-Sabha-from-UP/articleshow/52481986.cms",
        "text": "LUCKNOW: The Congress has fielded former union minister Kapil Sibal as its candidate for Rajya Sabha seat from Uttar Pradesh, a party spokesman said on Saturday.Sibal will be filing his nomination on May 30, the spokesman said.Elections will be held on June 11 for 11 Rajya Sabha seats falling vacant in July. The Congress can barely push one of its candidates, with each successful candidate requiring 36 votes in the 403-member house but the party only has 29 members.While it was rumoured that the state's ruling Samajwadi Party (SP) had offered a Rajya Sabha seat to Sibal but on the condition that he joins their party. However, the senior leader has stayed put with the Congress.In such a situation where only a handful of votes would be required for Sibal to be elected, Congress will prefer winning over \"friendly small parties\" like Ajit Singh's Rashtriya Lok Dal (RLD) rather than enter into an \"alliance with the SP\", a senior leader told IANS.",
        "score": 0.6507361833532919,
        "sentiment": "positive",
        "title": "Congress fields Kapil Sibal for Rajya Sabha from UP"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Lalu-Yadav-picks-daughter-Jethmalani-for-Rajya-Sabha-seats/articleshow/52482370.cms",
        "text": "PATNA: Rashtriya Janata Dal chief Lalu Prasad has chosen his elder daughter Misa Bharti and eminent lawyer Ram Jethmalani as party candidates for the biennial polls from Bihar to the Rajya Sabha next month.\"Till Thursday, it was concluded in political circles here that Lalu will nominate his wife and former chief minister Rabri Devi to the Rajya Sabha. But he has favoured his daughter Misa,\" a senior party leader said.\"Misa is young and articulate. She is a good orator, unlike her mother.\"According to party leaders, Lalu took the decision on Rashtriya Janata Dal (RJD) nominees after the party's national and state parliamentary boards authorised him last week on the matter.Lalu Yadav had fielded Misa for the Patliputra seat in Patna in the 2014 Lok Sabha polls, following which senior party leader and then Rajya Sabha MP Ramkirpal Yadav had revolted.Later Ramkirpal Yadav joined the Bharatiya Janata Party and contested against Misa, defeating her. Yadav is currently a minister in Prime Minister Narendra Modi's government.\"Lalu favoured Jethmalani for two reasons. First, he is a BJP basher after his expulsion from the BJP in 2013 and second, he has been helping the RJD leader in the multi-crore fodder scam cases,\" another RJD leader said.With 80 legislators in the Bihar assembly, two RJD nominees will easily sail through. Out of the total five Rajya Sabha seats, Chief Minister Nitish Kumar's Janata Dal-United with 71 legislators will field two candidates to the upper house of parliament. The opposition BJP with 53 legislators will nominate one candidate.The term of the five sitting Rajya Sabha MPs from Bihar will expire in July.",
        "score": 0.461640948160618,
        "sentiment": "positive",
        "title": "Lalu Yadav picks daughter, Jethmalani for Rajya Sabha seats"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Satyarthi-plans-global-campaign-for-child-rights/articleshow/52648656.cms",
        "text": "Minneapolis (US): Seeking to globalize compassion, Nobel laureate Kailash Satyarthi plans to launch a major initiative that will enlist support of other Nobel prize winners and world leaders for the cause of neglected and abused children.'The Laureates and Leaders Initiative for Children' will be initiated by the Kailash Satyarthi Children's Foundation and aims to bring Nobel laureates from all disciplines and not just the Peace Prize winners as well as world leaders together to use their \"moral authority\" for children's rights and fight against child slavery and trafficking.Satyarthi, 62, who shared the 2014 Nobel Peace Prize with Pakistani girls' rights activist Malala Yousafzai, 18, is also working on an ambitious '100 million for 100 million campaign' that will bring together 100 million youth from across the world to channelize their energy for fighting for the rights of the nearly 100 million children who are left out and are denied basic rights like education and proper healthcare.Satyarthi said he plans to launch the '100 million for 100 million' campaign by end of this year.\"I always believed in globalizing compassion. This time I want to engage an entire generation. We should not waste the energy, enthusiasm, eagerness and the idealism of our youth,\" Satyarthi told PTI in an interview here.In the city to headline the 2016 Nobel Peace Prize Forum, he said the energy of the youth should be harnessed and channelized for the betterment of the 100 million young people who do not have the same opportunities to grow and learn.\"They must feel that they have some moral responsibility and obligation towards the 100 million children and youth left out,\" he said.Satyarthi said he wants to launch the 100 million campaign along with 'The Laureates and Leaders Initiative' which will be a global campaign based in India.Explaining his reasoning behind the initiative, Satyarthi said after he won the Nobel prize, he realised that while the intellectual and academic knowledge of Nobel winners in other disciplines such as chemistry, physics, literature, economics and medicine had been utilised to advance human history, their \"moral authority and outreach\" had \"not been utilised and harnessed for children.\"",
        "score": 0.5915848734427791,
        "sentiment": "positive",
        "title": "Satyarthi plans global campaign for child rights"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Top-Jaish-commander-among-two-ultras-killed-in-Srinagar/articleshow/52410057.cms",
        "text": "SRINAGAR: A top commander of terror outfit Jaish-e-Mohammad was among two militants killed in a gunbattle with security forces in Maharaja Bazaar area of the city on Monday night.Security forces launched an operation in Maharaja Bazaar following information about the presence of militants in the area, a police official said.He said a gunfight broke out between security forces and militants.\"Two militants were killed in the encounter. One of the slain militants has been identified as Saifullah, a Pakistani national who was commander of Jamait-ul-Mujahideen, the others identity is being established,\" the police official said.The officer, however, did not confirm if these militants were involved in carrying out two deadly shoot and run attacks that left three policemen including an assistant sub-inspector, a head constable and a constable killed.",
        "score": -0.4703632173171644,
        "sentiment": "negative",
        "title": "Top JeM commander killed in Srinagar encounter"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Was-asked-to-give-clean-chit-to-wrongdoers-Jat-stir-panel-head/articleshow/52403430.cms",
        "text": "CHANDIGARH: Prakash Singh, who headed the committee that submitted a report on the violence during the Jat quota agitation, has claimed that attempts were made by some people to influence him during its preparation.Singh, without naming anyone, said certain people had tried to make him issue a \"clean chit\" to some wrongdoers.\"...things like provoking some leaders against the Committee, making 'sifarish' (influencing the Committee), these things started from the beginning (when the Committee was formed)\" the former Uttar Pradesh DGP told reporters on Sunday.Throwing more light, Singh said, \"When the probe was in its final stages, some people thought there can be a question mark on their future, you know these days many officials have their political patrons, they send them (to influence).\"But I will say one thing that everyone talked respectfully, they wanted that some people be given clean chit,\" he said.He said he prepared the report in an impartial manner as he felt his responsibility towards the people of Haryana has to be above all considerations.\"I listened to all of them, I listened with patience, but I thought my responsibility towards the people of Haryana has to be above all considerations. And discharging that duty, I wrote what I thought was true,\" he said.Singh said he hoped the state government would make the report public soon.\"I hope that Government puts this in public domain soon and ends its secrecy because many people have started to speculate about various things,\" he said.The Prakash Singh Committee report, submitted to the Haryana Chief Minister over a week back, found \"deliberate negligence\" on the part of 90 officials, including IAS and IPS officers, during the Jat quota agitation in February.The 450-page report submitted to the CM on May 13 is likely to be put in the public domain by month-end, official sources said.Singh said the officials who were negligent in performing their duty have been identified and their names given to the government.\"The government, on its part, has also started taking action on the report, many SDM, DSPs have been suspended,\" he said.",
        "score": 0.37478493457785095,
        "sentiment": "positive",
        "title": "Jat stir panel head coerced to give clean chit"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Counter-terrorism-NPT-on-Presidents-China-visit-agenda/articleshow/52412664.cms",
        "text": "NEW DELHI: President Pranab Mukherjee on Tuesday embarked on a four-day visit to China with an aim to bolster economic ties between the two countries and seek cooperation for combating designs of terror groups.During his first state visit to China, the President will be meeting his counterpart Xi Jinping, Premier Le Keqiang and other top leaders.He is likely to raise the issue of China blocking India's bid to get a UN ban on Jaish-e-Mohammed chief Masood Azhar and its insistence on India signing the Nuclear Non-Proliferation Treaty (NPT) to get membership of the elite Nuclear Suppliers Group (NSG).India had countered the Chinese contention of signing NPT before becoming a member of NSG as \"confusion\" as NPT allows civil nuclear cooperation with non-NPT countries.Ahead of his state visit to China, Mukherjee had told the Chinese state-run television that India seeks a fair, reasonable and mutually acceptable settlement of the boundary question which will help in achieving full potential of Sino-India relationship.\"We seek a fair, reasonable and mutually acceptable settlement of the boundary question and, pending the boundary settlement, to maintain peace and tranquillity in border areas. Both sides should strive to ensure that outstanding issues are addressed in a manner that demonstrates mutual sensitivity to each other's concerns, interests and aspirations,\" he had said last week.",
        "score": 0.4937319082755257,
        "sentiment": "positive",
        "title": "Counter-terrorism, NPT on President's China visit agenda"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Modi-government-is-a-total-failure-Congress/articleshow/52478847.cms",
        "text": "THIRUVANANTHAPURAM: Congress on Saturday alleged that the BJP-led NDA government's claim of achievements was a \"lie\" and it \"has not fulfilled any of the promises in the last two years\".\"Be it in jobs creation, growth in agriculture sector, GDP growth, containing food inflation and GDP growth, Modi government is a total failure. The achievements that the government talked about is a lie and it has not fulfilled any of the promises in the last two years rule,\" senior Congress leader Anil K Shastri told reporters here.He said the most laughable promise of Modi was with regard to bringing back black money and depositing Rs 15 lakh each in the bank accounts of every citizen.\"No black money has been unearthed. On the other hand more black money has come in the market,\" Shastri alleged.NDA that came to power on the plank of development had failed in keeping the promises and \"all indices affecting the ordinary citizen are in dire straits\".The agriculture growth of minus 0.2 per cent was the lowest growth rate in the sector in the recent years, he alleged.Taking a dig at Prime Minister Narendra Modi on his frequent foreign visits, Shastri said, \"It is not to promote India, but to promote Prime Minister himself. Let him promote himself, but he is not going to get any Nobel prize,\" Shastri said, adding, \"Modi has to be sensitive to the needs and aspirations of the people of the country\".He also attacked the Foreign policy of the NDA and said, \"it has been inconsistent, inept and incompetent\".To a question on the drubbing the party had received in the recent assembly polls, he said in Assam it was the anti-incumbency factor that led to the defeat. Besides, there was a false propaganda on emigrants by the BJP. However, he went on to add, \"We respect the mandate of the people.\"In Tamil Nadu, he said Congress was only a minor player.With regard to Kerala, Shastri maintained that UDF and LDF used to share the power alternately.However, he said the increase in the vote share of BJP has to be viewed seriously. \"Only Congress can stop the growth of BJP in the state,\" he claimed.\"BJP is covertly and overtly indulging in communal polarisation across the country,\" he alleged.",
        "score": -0.062192364259361324,
        "sentiment": "neutral",
        "title": "Modi government is a total failure: Congress"
    },
    {
        "url": "http://timesofindia.indiatimes.com/articleshow/52344367.cms",
        "text": "NEW DELHI: Sealing the Indo-Bangla border to check illegal infiltration will be top priority of the BJP government in Assam, Sarbananda Sonowal, who led the party to its maiden victory in the crucial North eastern state and is all set to be the Chief Minister, said today.Elated over BJP's spectular victory in Assam dethroning 15-year rule of Congress, Sonowal said protecting the interests of bonafide Indian citizens, whether they are Hindu or Muslims, will be the focus area of the BJP government.\"First of all we will have to seal the Indo-Bangla border to stop infiltration. We have to prepare within a time frame the NRC ( National Register of Citizens) with the names of bonafide Indian citizens. These are two big challenges,\" 54-year-old Sonowal said.Influx of Bangladeshis through the porous Indo-Bangla border has been a major issue in Assam and BJP and its allies had promised during the election campaign to check it.Sonowal said containing corruption will be another focus area. He said people were fed up with Congress and they wanted change and good government.\"People have accepted our winning combination. This is a great victory. People of Assam have been looking for such a combination... Our main target is to protect the interests of bonafide Indian citizens, whether they are Hindu or Muslims it doesn't matter.\"We have to protect the interests of greater Assamese society, which include Assamese, Bihari Marwaris, Bengalis, Hindus, Muslims, Christians, Sikhs... We have to work together, live together and fight together,\" he said soon after it became clear that BJP for the first time would get a majority in the 126-seat state Assembly.The Union Minister played down challenges to him from within the winning alliance, saying they all have to work together.BJP had stitched an alliance of virtually all regional parties, which represent various sections of indigenous population, to take on Congress and AIUDF, accusing the two parties of supporting infiltrators, mostly Bangladeshi Muslims.",
        "score": 0.02017070610699173,
        "sentiment": "neutral",
        "title": "Will seal Indo-Bangladesh border: Sonowal"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Trying-to-take-railways-out-of-ICU-Prabhu/articleshow/52464805.cms",
        "text": "NEW DELHI: Railway Minister Suresh Prabhu said on Friday that efforts are on to take the public transporter 'out of the ICU' and create a situation where it can breathe well.\"The railways was in deep trouble not now but in the last 20-30 years. That is what the Rakesh Mohan committee report had said. So now we are trying to create a situation where the railways will be able to breathe well,\" he told PTI.Asked whether the national transporter is still in the ICU, he said, \"We are trying to take it out of the ICU.\"On measures to make it robust, Prabhu said, \"In order to survive, the railways needs to revamp its operation. We are working on it. We are making it sure that the railways will be an engine of growth in the next few years. We are putting all our efforts into it.\"To a question about the railways' strategy since loadings are falling, the minister said a capacity to handle 1.2 billion tons of cargo will be created in the coming years.\"Freight (traffic) falling is not in our hands, it depends on the growth of the core sector. When core sector grows freight will also grow. But we are ready to handle 1.2 billion tons of cargo. In the railways' history for the first time, we have created such a handling capacity ahead of its demand. So now cargo has to come,\" he said.Asked whether the railways is considering hiking passenger fare since the freight is not picking up and passengers growth rate is also not high, Prabhu said the regulatory authority will decide on it.\"We are setting up a regulatory framework for fare decision. The regulator will decide what should be the fare,\" he said.On certain trains being introduced recently with increased fare, he hinted at a possible separate fare structure for the new services.\"We are starting four new products - Humsafar, Tejas, Antodaya and Uday. All these products will look at how to increase market share of the railways,\" the minister said.While the fare of recently launched Gatimaan Express is 25 per cent higher than Shatabdi, Mahamana Express was started with 15 per cent more than the regular train fare.According to Rail Budget proposals, Humsafar would be fully air-conditioned third AC service with an optional service for meals. Tejas, on the other hand, will showcase the future of train travel in India with operating speeds of 130 kmph and have on-board services such as entertainment, local cuisine, Wi-Fi.The railways also propose introduction of overnight Utkrisht Double-decker Air-conditioned Yatri (UDAY) Express on the busiest routes, which has the potential to increase carrying capacity by almost 40 per cent.There is also a proposal for the introduction of Antyodaya Express, a long-distance, fully unreserved, super-fast train service, for the common man to be operated on dense routes.",
        "score": 0.22356406498233,
        "sentiment": "positive",
        "title": "Trying to take railways out of ICU: Prabhu"
    },
    {
        "url": "http://timesofindia.indiatimes.com/india/Over-300-detained-in-AAP-rallies-against-BJP-Congress-corruption-alliance/articleshow/52160561.cms",
        "text": "NEW DELHI: Over 300 AAP supporters and some party leaders were detained on Saturday as they took out a protest march towards the residence of Prime Minister Narendra Modi alleging a BJP-Congress alliance in corruption.Following a rally at Jantar Mantar, where party chief Arvind Kejriwal and its top brass attacked Modi and his government for not taking action against Sonia Gandhi in AgustaWestland chopper scam, groups led by Sanjay Singh and Kumar Vishwas went to gherao residences of the Prime Minister and the Congress President.Kejriwal left the venue before the protest march began. Several AAP MLAs, including Deputy Speaker of the Delhi Legislative Assembly Bandana Kumar, participated in it.Police, which had made extensive preparations by putting up three layers of barricades, detained senior AAP leaders Ashutosh, Sanjay Singh, Dilip Pandey along with party volunteers, and took them to Parliament Street police station.\"Over 300 people were detained from the first layer of barricade in Parliament Street as they started their march from Jantar Mantar. And over 100 were detained in the morning. They were a separate group who had reached near Tughlaq Road police station, which is near the PM's residence, to protest.\"The protesters were detained under Section 144 of CrPC. They have all been taken to Parliament Street police station,\" DCP, New Delhi, Jatin Narwal said",
        "score": -0.6877840399709169,
        "sentiment": "negative",
        "title": "Over 300 detained in AAP rallies"
    }
]